lesson4_2/src/main/resources/soap-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://gb.ru/application/web/service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getGoodRequest>
          <gs:id>2</gs:id>   
        </gs:getGoodRequest>
    </soapenv:Body>
</soapenv:Envelope>